Merge pull request #37
Prepare repository for open source release
